:PROPERTIES:
:ID:       a0fe716e-61a1-4042-a47a-198f71d553a3
:END:
#+title: 闭包函数
#+filetags: :python:
* 什么是闭包函数
- 是内嵌函数
- 引用了其外层作用域（只要不是全局变量）中的变量

* 闭包名称的由来
- python中，内嵌函数作为返回值 传递给外部变量时，会把定义它时涉及到的 引用环境 和函数体本身 复制后打包成一个整体返回

  #+begin_src python :results output
def offset(n):
    base = n

    def step(i):
        return base + i

    return step

offset0 = offset(0)
offset100 = offset(100)

print(offset0(1))
print(offset100(1))
  #+end_src

  #+RESULTS:
  : 1
  : 101

  #+begin_src python :results output
def foo():
    b = 0
    def bar():
        a = b + 1
        return a
    return bar
c = foo()
print(c())
  #+end_src

  #+RESULTS:
  : 1
